Revit 2027 API
BuiltInFailures.ConversionFailures Class
 Failures about conversion of data to a different format.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ConversionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ConversionFailures
Public NotInheritable Class ConversionFailures
public ref class ConversionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ConversionFailures = class end
The BuiltInFailures.ConversionFailures type exposes the following members.
Properties
Name | Description
CannotConvertPercentToDouble |  Cannot convert concentration percent ' [Percentage Value] ' to double value
CannotConvertTempToDouble |  Cannot convert temperature '[Temperate Value]' to double value
CannotConvertToDouble |  Cannot convert '[Text] ' to double value
UndefinedFluidUnit |  Undefined fluid unit: '[Fluid Unit Type Name]'
UndefinedTemperatureUnit |  Undefined temperature unit: '[Temperature Unit Type Name]'
Top
See Also
Reference
Autodesk.Revit.DB Namespace